   ### Deployment Results ✅

   **JamesHaughey** successfully deployed branch `develop` to **production**
 
   <details><summary>Show Results</summary>
 
   ```terraform
Acquiring state lock. This may take a few moments...
module.tfstate_backend.module.log_storage.data.aws_partition.current: Reading...
module.tfstate_backend.data.aws_region.current: Reading...
module.tfstate_backend.module.log_storage.data.aws_caller_identity.current: Reading...
module.tfstate_backend.module.log_storage.data.aws_partition.current: Read complete after 0s [id=aws]
module.tfstate_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=elbokade-tf-state-backend-lock]
module.tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Reading...
module.tfstate_backend.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Read complete after 0s [id=3025385167]
module.tfstate_backend.aws_s3_bucket.default[0]: Refreshing state... [id=elbokade-tf-state-backend]
module.tfstate_backend.module.log_storage.data.aws_caller_identity.current: Read complete after 0s [id=587678272550]
module.tfstate_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=elbokade-tf-state-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/s3_bucket_name"] will be created
 + resource "aws_ssm_parameter" "default" {
     + arn            = (known after apply)
     + data_type      = "text"
     + id             = (known after apply)
     + insecure_value = (known after apply)
     + key_id         = (known after apply)
     + name           = "/elbokade/backend-state/s3_bucket_name"
     + overwrite      = true
     + tags_all       = (known after apply)
     + tier           = "Standard"
     + type           = "String"
     + value          = (sensitive value)
     + version        = (known after apply)
   }

Plan: 1 to add, 0 to change, 0 to destroy.
module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/s3_bucket_name"]: Creating...
module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/s3_bucket_name"]: Creation complete after 1s [id=/elbokade/backend-state/s3_bucket_name]

Warning: Argument is deprecated

 with module.tfstate_backend.aws_s3_bucket.default,
 on .terraform/modules/tfstate_backend/main.tf line 156, in resource "aws_s3_bucket" "default":
156: resource "aws_s3_bucket" "default" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 4 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

tfstate_backend_config = <<EOT
terraform {
 required_version = ">= 0.12.2"

 backend "s3" {
   region         = "eu-west-1"
   bucket         = "elbokade-tf-state-backend"
   key            = "terraform.tfstate"
   dynamodb_table = "elbokade-tf-state-backend-lock"
   profile        = ""
   role_arn       = ""
   encrypt        = "true"
 }
}

EOT

```
 
   </details>